
constraints = """
        特にコンポーネントは200行ほどのコードでしっかり出してください。
        必ずプログラム部分は以下の様に、3 つのバックティックで記載して、絶対に必ず閉じる様にしてください。
        ```javascript
        // ここにコードを記載してください
        ```
        Tailwind CSSを使用し、和風モダンなデザインを意識してください。
        '@/components/UI/は利用しない
        ダイナミックで動的なwebアプリケーションを作成してください。
        画像に相当するところは仮のボックスを挿入してください

        １ファイル１export、別のファイルの内容は記載せず、import処理でコンポーネントを呼び出してください。
        呼び出し例とかは書かないこと
        react-icons/lu' は利用せずlucide-reactを使用してください
        'react-feather' は利用せずlucide-reactを使用してください
        lucide-reactの'Funnel', 'GitNetwork', 'Sakura', 'Tool', 'Tree', 'FileTree','は利用せず、一般的なものを利用してください
        、各コンポーネントがデフォルトエクスポートされているため、
        中括弧 {} を使用せずに直接インポートする必要があります。

        メニューバーではメニューでコンポーネントに飛ぶだけで、パスに飛ぶ形にはしないで欲しい。
"""